{"_id":{"$oid":"602c9fd5a3bff60c06d80ebd"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thirller film, also know as suspense film or suspense thriller, is a broad film genre that involver excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonanthan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Anthony Hopkins","Jodie Foster","Kasi Lemmings"]}
{"_id":{"$oid":"602eeeb2a3bff60c06d80ec0"},"Title":"Spider-man: into the spider-verse","Description":"Bitten by a radioactive spider in the subway, Miles Morales suddenly develops mysterious powers that transform him into the one and only Spider-Man. When he meets Peter Parker, he soon realizes that there are many others who share his special, high-flying talents. Miles must now use his newfound skills to battle the evil Kingpin, a hulking madman who can open portals to other universes and pull different versions of Spider-Man into our world.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Bob Persichetti","Bio":"He is an American film Director, screenwriter, storyboard artist, and animator. He made his directorial debut with Spider-Man: Into the Spider-Verse (2018).","Birth":"1973-01-17","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjMwNDkxMTgzOF5BMl5BanBnXkFtZTgwNTkwNTQ3NjM@._V1_UX182_CR0,0,182,268_AL_.jpg'","Featured":true}
{"_id":{"$oid":"602eeedfa3bff60c06d80ec1"},"Title":"Black Panther","Description":"'T'challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country's past.","Genre":{"Name":"Adventure","Description":"Adventure films are usually exciting stories, with new experiences or exotic locales, very similar to or often paired with the action film genre. They can include traditional swashbucklers or pirate films, serialized films, and historical spectacles, searches or expeditions for lost continents, jungle and desert epics, treasure hunts, disaster films, or searches for the unknown."},"Director":{"Name":"Ryan Coogler'","Bio":"Ryan Coogler was born on May 23, 1986 in Oakland, California, USA as Ryan Kyle Coogler. He has been married to Zinzi Coogler since 2016.","Birth":"1986-05-23","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTg1MTY2MjYzNV5BMl5BanBnXkFtZTgwMTc4NTMwNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eef7aa3bff60c06d80ec2"},"Title":"The incredibles","Description":"Married superheroes Mr. Incredible and Elastigirl are forced to assume mundane lives after all super-powered activities have been banned by the government. While Mr. Incredible loves his wife and kids, he longs to return to a life of adventure, and he gets a chance when summoned to an island to battle an out-of-control robot. Soon, Mr. Incredible is in trouble, and it's up to his family to save him.","Genre":{"Name":"Kids and Family","Description":"Children and Family-Oriented Films are non-offensive, wholesome, and entertaining films that do not include topics or scenes with violence, foul language and other profanity, religious issues, gratuitous sexuality and so on, and are specifically designed for children 12 and under. They may be suitable for all age groups and often include a child actor/actress, and/or focus on children's-related themes that teach a lesson or moral, or show that good can triumph over evil."},"Director":{"Name":"Brad Bird","Bio":"Phillip Bradley 'Brad' Bird is an American director, screenwriter, animator, producer and occasional voice actor, known for both animated and live-action films. Bird was born in Kalispell, Montana, the youngest of four children of Marjorie A. (née Cross) and Philip Cullen Bird.","Birth":"1957-09-24","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTc0MDM3NDg4MV5BMl5BanBnXkFtZTgwNTcxNTEwMTE@._V1_UY268_CR3,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eef88a3bff60c06d80ec3"},"Title":"Avengers: Endgame","Description":"Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.","Genre":{"Name":"Sci-fi","Description":"Sci-fi films are often quasi-scientific, visionary and imaginative - complete with heroes, aliens, distant planets, impossible quests, improbable settings, fantastic places, great dark and shadowy villains, futuristic technology, unknown and unknowable forces, and extraordinary monsters, either created by mad scientists or by nuclear havoc. Science fiction often expresses the potential of technology to destroy humankind."},"Director":{"Name":"Anthony Russo","Bio":"Anthony Russo was born on February 3, 1970 in Cleveland, Ohio, USA as Anthony J. Russo.","Birth":"1970-02-03","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTc5MDE2ODcwNV5BMl5BanBnXkFtZTgwMzI2NzQ2NzM@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eef93a3bff60c06d80ec4"},"Title":"The dark knight","Description":"With the help of allies, Batman has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.","Genre":{"Name":"Adventure","Description":"Adventure films are usually exciting stories, with new experiences or exotic locales, very similar to or often paired with the action film genre. They can include traditional swashbucklers or pirate films, serialized films, and historical spectacles, searches or expeditions for lost continents, jungle and desert epics, treasure hunts, disaster films, or searches for the unknown."},"Director":{"Name":"Christopher Nolan","Bio":"Best known for his cerebral storytelling, writer-director Christopher Nolan was born on July 30, 1970, in London, England. Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.","Birth":"1970-07-30","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eefa0a3bff60c06d80ec5"},"Title":"Iron man","Description":"A billionaire industrialist and genius inventor, Tony Stark, is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.","Genre":{"Name":"Sci-fi","Description":"Sci-fi films are often quasi-scientific, visionary and imaginative - complete with heroes, aliens, distant planets, impossible quests, improbable settings, fantastic places, great dark and shadowy villains, futuristic technology, unknown and unknowable forces, and extraordinary monsters,, either created by mad scientists or by nuclear havoc. Science fiction often expresses the potential of technology to destroy humankind."},"Director":{"Name":"Christopher Nolan","Bio":"Best known for his cerebral storytelling, writer-director Christopher Nolan was born on July 30, 1970, in London, England. Nolan has gone from low-budget independent films to working on some of the biggest blockbusters ever made.","Birth":"1970-07-30","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTczNTI2ODUwOF5BMl5BanBnXkFtZTcwMTU0NTIzMw@@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eefb4a3bff60c06d80ec6"},"Title":"Superman","Description":"Just before the destruction of the planet Krypton, scientist Jor-El sends his infant son Kal-El on a spaceship to Earth. Raised by kindly farmers, young Clark discovers the source of his superhuman powers and moves to Metropolis to fight evil. As Superman, he battles the villainous Lex Luthor, while, as novice reporter, he attempts to woo co-worker Lois Lane.","Genre":{"Name":"Adventure","Description":"Adventure films are usually exciting stories, with new experiences or exotic locales, very similar to or often paired with the action film genre. They can include traditional swashbucklers or pirate films, serialized films, and historical spectacles, searches or expeditions for lost continents, jungle and desert epics, treasure hunts, disaster films, or searches for the unknown."},"Director":{"Name":"Richard Donner","Bio":"Richard Donner is a director and producer, known for Superman (1978), Ladyhawke (1985) and Lethal Weapon (1987).","Birth":"1930-04-24","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMzA0YWMwMTUtMTVhNC00NjRkLWE2ZTgtOWEzNjJhYzNiMTlkXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eefc2a3bff60c06d80ec7"},"Title":"Wonder Woman","Description":"Raised on a sheltered island paradise, Diana meets an American pilot who tells her about the massive conflict that’s raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting to end all wars, she finally discovers her full powers and true destiny.","Genre":{"Name":"Adventure","Description":"Adventure films are usually exciting stories, with new experiences or exotic locales, very similar to or often paired with the action film genre. They can include traditional swashbucklers or pirate films, serialized films, and historical spectacles, searches or expeditions for lost continents, jungle and desert epics, treasure hunts, disaster films, or searches for the unknown."},"Director":{"Name":"Patty Jenkins","Bio":"Patty Jenkins is a writer/director best known for directing Wonder Woman, the Warner Bros./DC Comics blockbuster of 2017, and her debut feature Monster. Patty also works in television where she is best known for the pilot and finale episode of AMC's hit show The Killing.","Birth":"1971-07-24","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTYzODQzYjQtNTczNC00MzZhLTg1ZWYtZDUxYmQ3ZTY4NzA1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eefd2a3bff60c06d80ec8"},"Title":"Thor: Ragnarok","Description":"Imprisoned on the other side of the universe, Thor finds himself in a deadly gladiatorial contest that pits him against the Hulk, his former ally and fellow Avenger. Thor’s quest for survival leads him in a race against time to prevent the all-powerful Hela from destroying his home world and the Asgardian civilization.","Genre":{"Name":"Adventure","Description":"Adventure films are usually exciting stories, with new experiences or exotic locales, very similar to or often paired with the action film genre. They can include traditional swashbucklers or pirate films, serialized films, and historical spectacles, searches or expeditions for lost continents, jungle and desert epics, treasure hunts, disaster films, or searches for the unknown."},"Director":{"Name":"Taika Waititi","Bio":"Taika Waititi, also known as Taika Cohen, hails from the Raukokore region of the East Coast of New Zealand, and is the son of Robin (Cohen), a teacher, and Taika Waiti, an artist and farmer. His father is Maori (Te-Whanau-a-Apanui), and his mother is of Ashkenazi Jewish, Irish, Scottish, and English descent. Taika has been involved in the film industry for several years, initially as an actor, and now focusing on writing and directing.","Birth":"1975-08-16","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMjMyNDkzMzI1OF5BMl5BanBnXkFtZTgwODcxODg5MjI@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
{"_id":{"$oid":"602eefdba3bff60c06d80ec9"},"Title":"Logan","Description":"A weary Logan cares for an ailing Professor X at a remote outpost on the Mexican border. His plan to hide from the outside world gets upended when he meets a young mutant who is very much like him. Logan must now protect the girl and battle the dark forces that want to capture her.","Genre":{"Name":"Action","Description":"Action films usually include high energy, big-budget physical stunts and chases, possibly with rescues, battles, fights, escapes, destructive crises,, non-stop motion, spectacular rhythm and pacing, and adventurous, often two-dimensional 'good-guy' heroes or heroines battling 'bad guys' - all designed for pure audience escapism."},"Director":{"Name":"James Mangold","Bio":"James Mangold is an American film and television director, screenwriter and producer. Films he has directed include Girl, Interrupted (1999), Walk the Line (2005), which he also co-wrote, the 2007 remake 3:10 to Yuma (2007), The Wolverine (2013), and Logan (2017).","Birth":"1963-12-16","Death":""},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYzc5MTU4N2EtYTkyMi00NjdhLTg3NWEtMTY4OTEyMzJhZTAzXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true}
